micropython/micropython/ports/esp32/machine_can.c
/* The MIT License (MIT)
 *
 * Copyright (c) 2019 Musumeci Salvatore
 * Copyright (c) 2021 Ihor Nehrutsa
 * Copyright (c) 2022 Yuriy Makarov
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */
// #include <string.h>

#include "mpconfigport.h"
#include "py/obj.h"
#include "py/objarray.h"
#include "py/binary.h"
#include "py/runtime.h"
#include "py/builtin.h"
#include "py/mphal.h"
#include "py/mperrno.h"
#include "mpconfigport.h"
#include "freertos/task.h"
#include "esp_idf_version.h"

#include "esp_err.h"
#include "esp_log.h"
#include "soc/soc_caps.h"
#include "soc/clk_tree_defs.h"
#include "soc/twai_periph.h"
#include "hal/twai_types.h"
#include "hal/twai_hal.h"
#include "driver/twai.h"
#include "esp_task.h"
#include "machine_can.h"

#if MICROPY_PY_MACHINE_CAN

#define debug_printf(...)  mp_printf(&mp_plat_print, __VA_ARGS__); mp_printf(&mp_plat_print, " | %d at %s\n", __LINE__, __FILE__);

// Default bitrate: 500kb
#define CAN_TASK_PRIORITY           (ESP_TASK_PRIO_MIN + 1)
#define CAN_TASK_STACK_SIZE         (1024)
#define CAN_DEFAULT_PRESCALER (8)
#define CAN_DEFAULT_SJW (3)
#define CAN_DEFAULT_BS1 (15)
#define CAN_DEFAULT_BS2 (4)
#define CAN_MAX_DATA_FRAME          (8)

// #define TWAI_TIMING_CONFIG_20KBITS()    {.clk_src = TWAI_CLK_SRC_DEFAULT, .quanta_resolution_hz = 400000, .brp = 0, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}

// static const twai_timing_config_t t_config = TWAI_TIMING_CONFIG_500KBITS();
static const twai_filter_config_t f_config = TWAI_FILTER_CONFIG_ACCEPT_ALL();

// singleton CAN device object
esp32_can_config_t can_config = {
    .general = TWAI_GENERAL_CONFIG_DEFAULT(GPIO_NUM_2, GPIO_NUM_4, TWAI_MODE_NORMAL),
    .filter = TWAI_FILTER_CONFIG_ACCEPT_ALL(),
    .timing = TWAI_TIMING_CONFIG_500KBITS(),
    .initialized = false
};

static esp32_can_obj_t esp32_can_obj = {
    {&machine_can_type},
    .config = &can_config,
    .handle = NULL,
};

// INTERNAL Deinitialize can
void can_deinit(const esp32_can_obj_t *self) {
    if (self->handle) {
        check_esp_err(twai_stop_v2(self->handle));
        check_esp_err(twai_driver_uninstall_v2(self->handle));
    }
    if (self->irq_handler != NULL) {
        vTaskDelete(self->irq_handler);
    }
    self->config->initialized = false;
}

static void esp32_can_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    esp32_can_obj_t *self = MP_OBJ_TO_PTR(self_in);

    if (self->config->initialized) {
        qstr mode;
        switch (self->config->general.mode) {
            case TWAI_MODE_LISTEN_ONLY:
                mode = MP_QSTR_LISTEN;
                break;
            case TWAI_MODE_NO_ACK:
                mode = MP_QSTR_NO_ACK;
                break;
            case TWAI_MODE_NORMAL:
                mode = MP_QSTR_NORMAL;
                break;
            default:
                mode = MP_QSTR_UNKNOWN;
                break;
        }
        mp_printf(print, "CAN(tx=%u, rx=%u, bitrate=%u, mode=%q, loopback=%u, extframe=%u)",
            self->config->general.tx_io,
            self->config->general.rx_io,
            self->config->bitrate,
            mode,
            self->loopback,
            self->extframe);
    } else {
        mp_printf(print, "Device is not initialized");
    }
}

// INTERNAL FUNCTION FreeRTOS IRQ task
static void esp32_can_irq_task(void *self_in) {
    esp32_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    uint32_t alerts;

    check_esp_err(twai_reconfigure_alerts_v2(self->handle, TWAI_ALERT_ALL,
        // TWAI_ALERT_RX_DATA | TWAI_ALERT_RX_QUEUE_FULL | TWAI_ALERT_BUS_OFF | TWAI_ALERT_ERR_PASS |
        // TWAI_ALERT_ABOVE_ERR_WARN | TWAI_ALERT_TX_FAILED | TWAI_ALERT_TX_SUCCESS | TWAI_ALERT_BUS_RECOVERED,
        // TWAI_ALERT_TX_IDLE | TWAI_ALERT_BELOW_ERR_WARN | TWAI_ALERT_ERR_ACTIVE | TWAI_ALERT_RECOVERY_IN_PROGRESS |
        // TWAI_ALERT_ARB_LOST | TWAI_ALERT_BUS_ERROR | TWAI_ALERT_RX_FIFO_OVERRUN | TWAI_ALERT_TX_RETRIED | TWAI_ALERT_PERIPH_RESET,
        NULL
        ));

    while (1) {
        check_esp_err(twai_read_alerts_v2(self->handle, &alerts, portMAX_DELAY));


        if (alerts & TWAI_ALERT_BUS_OFF) {
            for (int i = 3; i > 0; i--) {
                vTaskDelay(pdMS_TO_TICKS(1000));
            }
            twai_initiate_recovery_v2(self->handle); // Needs 128 occurrences of bus free signal
        }
        if (alerts & TWAI_ALERT_BUS_OFF) {
            ++self->num_bus_off;
        }
        if (alerts & TWAI_ALERT_ERR_PASS) {
            ++self->num_error_passive;
        }
        if (alerts & TWAI_ALERT_ABOVE_ERR_WARN) {
            ++self->num_error_warning;
        }
        if (alerts & (TWAI_ALERT_BUS_RECOVERED)) {
            self->bus_recovery_success = 1;
        }

        if (alerts & (TWAI_ALERT_TX_FAILED | TWAI_ALERT_TX_SUCCESS)) {
            self->last_tx_success = (alerts & TWAI_ALERT_TX_SUCCESS) > 0;
        }

        if (self->tx_callback != mp_const_none) {
            check_esp_err(twai_get_status_info_v2(self->handle, &self->status));
            if (alerts & TWAI_ALERT_TX_IDLE) {
                mp_sched_schedule(self->tx_callback, MP_OBJ_NEW_SMALL_INT(0));
            }
            if (alerts & TWAI_ALERT_TX_SUCCESS) {
                mp_sched_schedule(self->tx_callback, MP_OBJ_NEW_SMALL_INT(1));
            }
            if (alerts & TWAI_ALERT_TX_FAILED) {
                mp_sched_schedule(self->tx_callback, MP_OBJ_NEW_SMALL_INT(2));
            }
            if (alerts & TWAI_ALERT_TX_RETRIED) {
                mp_sched_schedule(self->tx_callback, MP_OBJ_NEW_SMALL_INT(3));
            }
        }

        if (self->rx_callback != mp_const_none) {
            if (alerts & TWAI_ALERT_RX_DATA) {
                check_esp_err(twai_get_status_info_v2(self->handle, &self->status));
                uint32_t msgs_to_rx = self->status.msgs_to_rx;

                if (msgs_to_rx == 1) {
                    // first message in queue
                    mp_sched_schedule(self->rx_callback, MP_OBJ_NEW_SMALL_INT(0));
                } else if (msgs_to_rx >= self->config->general.rx_queue_len) {
                    // queue is full
                    mp_sched_schedule(self->rx_callback, MP_OBJ_NEW_SMALL_INT(1));
                }
            }
            if (alerts & TWAI_ALERT_RX_QUEUE_FULL) {
                // queue overflow
                mp_sched_schedule(self->rx_callback, MP_OBJ_NEW_SMALL_INT(2));
            }
            if (alerts & TWAI_ALERT_RX_FIFO_OVERRUN) {
                mp_sched_schedule(self->rx_callback, MP_OBJ_NEW_SMALL_INT(3));
            }
        }
    }
}

static mp_obj_t esp32_can_init_helper(esp32_can_obj_t *self, size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_mode, ARG_prescaler, ARG_sjw, ARG_bs1, ARG_bs2, ARG_auto_restart, ARG_bitrate, ARG_extframe,
           ARG_tx_io, ARG_rx_io, ARG_clkout_io, ARG_bus_off_io, ARG_tx_queue, ARG_rx_queue};
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_mode, MP_ARG_REQUIRED | MP_ARG_INT, {.u_int = TWAI_MODE_NORMAL} },
        { MP_QSTR_prescaler, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = CAN_DEFAULT_PRESCALER} },
        { MP_QSTR_sjw, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = CAN_DEFAULT_SJW} },
        { MP_QSTR_bs1, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = CAN_DEFAULT_BS1} },
        { MP_QSTR_bs2, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = CAN_DEFAULT_BS2} },
        { MP_QSTR_auto_restart, MP_ARG_BOOL, {.u_bool = false} },
        { MP_QSTR_bitrate, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 500000} },
        { MP_QSTR_extframe, MP_ARG_BOOL, {.u_bool = false} },
        { MP_QSTR_tx, MP_ARG_INT, {.u_int = 4} },
        { MP_QSTR_rx, MP_ARG_INT, {.u_int = 5} },
        { MP_QSTR_clkout, MP_ARG_INT, {.u_int = TWAI_IO_UNUSED} },
        { MP_QSTR_bus_off, MP_ARG_INT, {.u_int = TWAI_IO_UNUSED} },
        { MP_QSTR_tx_queue, MP_ARG_INT, {.u_int = 1} },
        { MP_QSTR_rx_queue, MP_ARG_INT, {.u_int = 1} },
    };

    // parse args
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

