micropython/micropython/ports/esp32/machine_can.c
    // Defaults from TWAI_FILTER_CONFIG_ACCEPT_ALL
    self->config->filter = f_config; // TWAI_FILTER_CONFIG_ACCEPT_ALL(); //

    // Apply filter
    check_esp_err(twai_stop_v2(self->handle));
    check_esp_err(twai_driver_uninstall_v2(self->handle));
    check_esp_err(twai_driver_install_v2(
        &self->config->general,
        &self->config->timing,
        &self->config->filter, &self->handle));
    check_esp_err(twai_start_v2(self->handle));
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(esp32_can_clearfilter_obj, esp32_can_clearfilter);

// bank: 0 only
// mode: FILTER_RAW_SINGLE, FILTER_RAW_DUAL or FILTER_ADDR_SINGLE or FILTER_ADDR_DUAL
// params: [id, mask]
// rtr: ignored if FILTER_RAW
// Set CAN HW filter
// CAN.set_filters(filters)
static mp_obj_t esp32_can_set_filters(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_bank, ARG_mode, ARG_params, ARG_rtr, ARG_extframe };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_bank,     MP_ARG_REQUIRED | MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_mode,     MP_ARG_REQUIRED | MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_params,   MP_ARG_REQUIRED | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL} },
        { MP_QSTR_rtr,      MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_bool = false} },
        { MP_QSTR_extframe, MP_ARG_BOOL,                  {.u_bool = false} },
    };

    // parse args
    esp32_can_obj_t *self = MP_OBJ_TO_PTR(pos_args[0]);
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);
    const int can_idx = args[ARG_bank].u_int;

    if (can_idx != 0) {
        mp_raise_msg_varg(&mp_type_ValueError, "Bank (%d) doesn't exist", can_idx);
    }

    size_t len;
    mp_obj_t *params;
    mp_obj_get_array(args[ARG_params].u_obj, &len, &params);
    const int mode = args[ARG_mode].u_int;

    uint32_t id = mp_obj_get_int(params[0]);
    uint32_t mask = mp_obj_get_int(params[1]); // FIXME: Overflow in case 0xFFFFFFFF for mask
    if (mode == FILTER_RAW_SINGLE || mode == FILTER_RAW_DUAL) {
        if (len != 2) {
            mp_raise_ValueError("params must be a 2-values list");
        }
        self->config->filter.single_filter = (mode == FILTER_RAW_SINGLE);
        self->config->filter.acceptance_code = id;
        self->config->filter.acceptance_mask = mask;
    } else {
        self->config->filter.single_filter = self->extframe;
        // esp32_can_set_filters(self, id, mask, args[ARG_bank].u_int, args[ARG_rtr].u_int);
        // Check if bank is allowed
        int bank = 0;
        if (bank > ((self->extframe && self->config->filter.single_filter) ? 0 : 1)) {
            mp_raise_ValueError("CAN filter parameter error");
        }
        uint32_t preserve_mask;
        int addr = 0;
        int rtr = 0;
        if (self->extframe) {
            addr = (addr & 0x1FFFFFFF) << 3 | (rtr ? 0x04 : 0);
            mask = (mask & 0x1FFFFFFF) << 3 | 0x03;
            preserve_mask = 0;
        } else if (self->config->filter.single_filter) {
            addr = (((addr & 0x7FF) << 5) | (rtr ? 0x10 : 0));
            mask = ((mask & 0x7FF) << 5);
            mask |= 0xFFFFF000;
            preserve_mask = 0;
        } else {
            addr = (((addr & 0x7FF) << 5) | (rtr ? 0x10 : 0));
            mask = ((mask & 0x7FF) << 5);
            preserve_mask = 0xFFFF << (bank == 0 ? 16 : 0);
            if ((self->config->filter.acceptance_mask & preserve_mask) == (0xFFFF << (bank == 0 ? 16 : 0))) {
                // Other filter accepts all; it will replaced duplicating current filter
                addr = addr | (addr << 16);
                mask = mask | (mask << 16);
                preserve_mask = 0;
            } else {
                addr = addr << (bank == 1 ? 16 : 0);
                mask = mask << (bank == 1 ? 16 : 0);
            }
        }
        self->config->filter.acceptance_code &= preserve_mask;
        self->config->filter.acceptance_code |= addr;
        self->config->filter.acceptance_mask &= preserve_mask;
        self->config->filter.acceptance_mask |= mask;
    }
    // Apply filter
    if (self->handle) {
        check_esp_err(twai_stop_v2(self->handle));
        check_esp_err(twai_driver_uninstall_v2(self->handle));
    }
    check_esp_err(twai_driver_install_v2(
        &self->config->general,
        &self->config->timing,
        &self->config->filter,
        &self->handle
        ));
    check_esp_err(twai_start_v2(self->handle));
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(esp32_can_set_filters_obj, 1, esp32_can_set_filters);

// CAN.irq_recv(callback, hard=False)
static mp_obj_t esp32_can_irq_recv(mp_obj_t self_in, mp_obj_t callback_in) {
    esp32_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (callback_in == mp_const_none) {
        // disable callback
        self->rx_callback = mp_const_none;
    } else if (mp_obj_is_callable(callback_in)) {
        // set up interrupt
        self->rx_callback = callback_in;
    }
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(esp32_can_irq_recv_obj, esp32_can_irq_recv);

// CAN.irq_send(callback, hard=False)
static mp_obj_t esp32_can_irq_send(mp_obj_t self_in, mp_obj_t callback_in) {
    esp32_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    // mp_obj_t callback_in = NULL;
    if (callback_in == mp_const_none) {
        // disable callback
        self->tx_callback = mp_const_none;
    } else if (mp_obj_is_callable(callback_in)) {
        // set up interrupt
        self->tx_callback = callback_in;
    }
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_2(esp32_can_irq_send_obj, esp32_can_irq_send);

// CAN.get_state()
static mp_obj_t esp32_can_get_state(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(esp32_can_get_state_obj, 3, esp32_can_get_state);

// CAN.get_counters([list] /)
static mp_obj_t esp32_can_get_counters(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(esp32_can_get_counters_obj, 3, esp32_can_get_counters);

// CAN.get_timings([list])
static mp_obj_t esp32_can_get_timings(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(esp32_can_get_timings_obj, 3, esp32_can_get_timings);

