micropython/micropython/ports/esp32/machine_can.c
// CAN.reset(mode=CAN.Mode.NORMAL)
static mp_obj_t esp32_can_reset(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(esp32_can_reset_obj, 3, esp32_can_reset);

// CAN.mode([mode])
static mp_obj_t esp32_can_mode(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_KW(esp32_can_mode_obj, 3, esp32_can_mode);

// Clear TX Queue
static mp_obj_t esp32_can_clear_tx_queue(mp_obj_t self_in) {
    const esp32_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    return mp_obj_new_bool(twai_clear_transmit_queue_v2(self->handle) == ESP_OK);
}
static MP_DEFINE_CONST_FUN_OBJ_1(esp32_can_clear_tx_queue_obj, esp32_can_clear_tx_queue);

// Clear RX Queue
static mp_obj_t esp32_can_clear_rx_queue(mp_obj_t self_in) {
    const esp32_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    return mp_obj_new_bool(twai_clear_receive_queue_v2(self->handle) == ESP_OK);
}
static MP_DEFINE_CONST_FUN_OBJ_1(esp32_can_clear_rx_queue_obj, esp32_can_clear_rx_queue);

static const mp_rom_map_elem_t esp32_can_locals_dict_table[] = {
    // CAN_ATTRIBUTES
    { MP_ROM_QSTR(MP_QSTR___name__), MP_ROM_QSTR(MP_QSTR_CAN) },
    // Micropython Generic API
    { MP_ROM_QSTR(MP_QSTR_init), MP_ROM_PTR(&esp32_can_init_obj) },
    { MP_ROM_QSTR(MP_QSTR_deinit), MP_ROM_PTR(&esp32_can_deinit_obj) },
    { MP_ROM_QSTR(MP_QSTR_restart), MP_ROM_PTR(&esp32_can_restart_obj) },
    { MP_ROM_QSTR(MP_QSTR_state), MP_ROM_PTR(&esp32_can_state_obj) },
    { MP_ROM_QSTR(MP_QSTR_info), MP_ROM_PTR(&esp32_can_info_obj) },
    { MP_ROM_QSTR(MP_QSTR_any), MP_ROM_PTR(&esp32_can_any_obj) },
    { MP_ROM_QSTR(MP_QSTR_send), MP_ROM_PTR(&esp32_can_send_obj) },
    { MP_ROM_QSTR(MP_QSTR_recv), MP_ROM_PTR(&esp32_can_recv_obj) },
    { MP_ROM_QSTR(MP_QSTR_irq_send), MP_ROM_PTR(&esp32_can_irq_send_obj) },
    { MP_ROM_QSTR(MP_QSTR_irq_recv), MP_ROM_PTR(&esp32_can_irq_recv_obj) },
    { MP_ROM_QSTR(MP_QSTR_set_filters), MP_ROM_PTR(&esp32_can_set_filters_obj) },
    { MP_ROM_QSTR(MP_QSTR_clearfilter), MP_ROM_PTR(&esp32_can_clearfilter_obj) },

    { MP_ROM_QSTR(MP_QSTR_get_state), MP_ROM_PTR(&esp32_can_get_state_obj) },
    { MP_ROM_QSTR(MP_QSTR_get_counters), MP_ROM_PTR(&esp32_can_get_counters_obj) },
    { MP_ROM_QSTR(MP_QSTR_get_timings), MP_ROM_PTR(&esp32_can_get_timings_obj) },
    { MP_ROM_QSTR(MP_QSTR_reset), MP_ROM_PTR(&esp32_can_reset_obj) },
    { MP_ROM_QSTR(MP_QSTR_mode), MP_ROM_PTR(&esp32_can_mode_obj) },
    // ESP32 Specific API
    { MP_OBJ_NEW_QSTR(MP_QSTR_clear_tx_queue), MP_ROM_PTR(&esp32_can_clear_tx_queue_obj) },
    { MP_OBJ_NEW_QSTR(MP_QSTR_clear_rx_queue), MP_ROM_PTR(&esp32_can_clear_rx_queue_obj) },
    { MP_OBJ_NEW_QSTR(MP_QSTR_get_alerts), MP_ROM_PTR(&esp32_can_alert_obj) },
    // CAN_MODE
    // class CAN.Mode
    { MP_ROM_QSTR(MP_QSTR_NORMAL), MP_ROM_INT(MODE_NORMAL) },
    { MP_ROM_QSTR(MP_QSTR_SLEEP), MP_ROM_INT(MODE_SLEEP) },
    { MP_ROM_QSTR(MP_QSTR_LOOPBACK), MP_ROM_INT(MODE_LOOPBACK) },
    { MP_ROM_QSTR(MP_QSTR_SILENT), MP_ROM_INT(MODE_SILENT) },
    { MP_ROM_QSTR(MP_QSTR_SILENT_LOOPBACK), MP_ROM_INT(MODE_SILENT_LOOPBACK) },
    { MP_ROM_QSTR(MP_QSTR_LISTEN_ONLY), MP_ROM_INT(MODE_LISTEN_ONLY) },
/* esp32 can modes
TWAI_MODE_NORMAL      - Normal operating mode where TWAI controller can send/receive/acknowledge messages
TWAI_MODE_NO_ACK      - Transmission does not require acknowledgment. Use this mode for self testing. // This mode is useful when self testing the TWAI controller (loopback of transmissions).
TWAI_MODE_LISTEN_ONLY - The TWAI controller will not influence the bus (No transmissions or acknowledgments) but can receive messages. // This mode is suited for bus monitor applications.
*/
/* stm32 can modes
#define CAN_MODE_NORMAL             FDCAN_MODE_NORMAL
#define CAN_MODE_LOOPBACK           FDCAN_MODE_EXTERNAL_LOOPBACK
#define CAN_MODE_SILENT             FDCAN_MODE_BUS_MONITORING
#define CAN_MODE_SILENT_LOOPBACK    FDCAN_MODE_INTERNAL_LOOPBACK
*/
    // CAN_STATE
    // class CAN.State
    { MP_ROM_QSTR(MP_QSTR_STOPPED), MP_ROM_INT(TWAI_STATE_STOPPED) },
    { MP_ROM_QSTR(MP_QSTR_ERROR_ACTIVE), MP_ROM_INT(TWAI_STATE_RUNNING) },
    { MP_ROM_QSTR(MP_QSTR_ERROR_WARNING), MP_ROM_INT(-1) },
    { MP_ROM_QSTR(MP_QSTR_ERROR_PASSIVE), MP_ROM_INT(-1) },
    { MP_ROM_QSTR(MP_QSTR_BUS_OFF), MP_ROM_INT(TWAI_STATE_BUS_OFF) },
    { MP_ROM_QSTR(MP_QSTR_RECOVERING), MP_ROM_INT(TWAI_STATE_RECOVERING) }, // esp32 specific

    // class CAN.MessageFlags
    { MP_ROM_QSTR(MP_QSTR_RTR), MP_ROM_INT(RTR) },
    { MP_ROM_QSTR(MP_QSTR_EXTENDED_ID), MP_ROM_INT(EXTENDED_ID) },
    { MP_ROM_QSTR(MP_QSTR_FD_F), MP_ROM_INT(FD_F) },
    { MP_ROM_QSTR(MP_QSTR_BRS), MP_ROM_INT(BRS) },
    // class CAN.RecvErrors
    { MP_ROM_QSTR(MP_QSTR_CRC), MP_ROM_INT(CRC) },
    { MP_ROM_QSTR(MP_QSTR_FORM), MP_ROM_INT(FORM) },
    { MP_ROM_QSTR(MP_QSTR_OVERRUN), MP_ROM_INT(OVERRUN) },
    { MP_ROM_QSTR(MP_QSTR_ESI), MP_ROM_INT(ESI) },
    // class CAN.SendErrors
    { MP_ROM_QSTR(MP_QSTR_ARB), MP_ROM_INT(ARB) },
    { MP_ROM_QSTR(MP_QSTR_NACK), MP_ROM_INT(NACK) },
    { MP_ROM_QSTR(MP_QSTR_ERR), MP_ROM_INT(ERR) },
    // CAN_FILTER_MODE
    { MP_ROM_QSTR(MP_QSTR_FILTER_RAW_SINGLE), MP_ROM_INT(FILTER_RAW_SINGLE) },
    { MP_ROM_QSTR(MP_QSTR_FILTER_RAW_DUAL), MP_ROM_INT(FILTER_RAW_DUAL) },
    { MP_ROM_QSTR(MP_QSTR_FILTER_ADDRESS), MP_ROM_INT(FILTER_ADDRESS) },
    // CAN_ALERT
    { MP_ROM_QSTR(MP_QSTR_ALERT_ALL), MP_ROM_INT(TWAI_ALERT_ALL) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_TX_IDLE), MP_ROM_INT(TWAI_ALERT_TX_IDLE) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_TX_SUCCESS), MP_ROM_INT(TWAI_ALERT_TX_SUCCESS) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_BELOW_ERR_WARN), MP_ROM_INT(TWAI_ALERT_BELOW_ERR_WARN) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_ERR_ACTIVE), MP_ROM_INT(TWAI_ALERT_ERR_ACTIVE) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_RECOVERY_IN_PROGRESS), MP_ROM_INT(TWAI_ALERT_RECOVERY_IN_PROGRESS) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_BUS_RECOVERED), MP_ROM_INT(TWAI_ALERT_BUS_RECOVERED) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_ARB_LOST), MP_ROM_INT(TWAI_ALERT_ARB_LOST) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_ABOVE_ERR_WARN), MP_ROM_INT(TWAI_ALERT_ABOVE_ERR_WARN) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_BUS_ERROR), MP_ROM_INT(TWAI_ALERT_BUS_ERROR) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_TX_FAILED), MP_ROM_INT(TWAI_ALERT_TX_FAILED) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_RX_QUEUE_FULL), MP_ROM_INT(TWAI_ALERT_RX_QUEUE_FULL) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_ERR_PASS), MP_ROM_INT(TWAI_ALERT_ERR_PASS) },
    { MP_ROM_QSTR(MP_QSTR_ALERT_BUS_OFF), MP_ROM_INT(TWAI_ALERT_BUS_OFF) }
};
static MP_DEFINE_CONST_DICT(esp32_can_locals_dict, esp32_can_locals_dict_table);

// Python object definition
MP_DEFINE_CONST_OBJ_TYPE(
    machine_can_type,
    MP_QSTR_CAN,
    MP_TYPE_FLAG_NONE,
    make_new, esp32_can_make_new,
    print, esp32_can_print,
    locals_dict, (mp_obj_dict_t *)&esp32_can_locals_dict
    );

#endif // MICROPY_PY_MACHINE_CAN
